#+TITLE: DM1 Week 04 Teach
#+LANGUAGE: en
#+OPTIONS: H:4 num:nil toc:nil \n:nil @:t ::t |:t ^:t *:t TeX:t LaTeX:t
#+OPTIONS: html-postamble:nil
#+STARTUP: showeverything entitiespretty
#+SETUPFILE: ../theme-bigblow.setup

[[elisp:(find-file-other-window%20"../week00/00-prepare.org")][Read Instructions]]
[[elisp:(browse-url-of-file%20(org-html-export-to-html))][Export to HTML and Browse]]
[[elisp:(org-clock-report%201)][Insert/Update Clock Summary Report]]
* TODO Exercise Your Understanding
  Write elisp code that takes two same-sized vectors of one-character symbols
  and \ldquo{}shuffles\rdquo them together into one vector. For example:

#+BEGIN_SRC emacs-lisp
  (shuffle [A B C] [x y z])
#+END_SRC

#+RESULTS:
: [A x B y C z]

  The challenge? Do it without using loops!

** Hint
  It can be done with one line of code in the body of the =shuffle= defun. This
  one line of code uses four functions, two of which take another function as an
  argument, the other two being those argument functions. The names of these
  four functions will be revealed during class.
* TODO Discuss
  In subsubsection GHS Roger Penrose is quoted. Discuss this quote with your
  neighbors (teams, groups, same as before or different), focusing on how he
  relates awareness, understanding and intelligence. Then consider the
  following:

  In Doctrine and Covenants section 93 the Lord defines some words. In
  particular, Doctrine and Covenants 93:24 defines truth as /knowledge
  of things as they are, and as they were, and as they are to come./
  Later, verse 29 equates /intelligence/ with /the light of truth/.
  Even later, in verse 36, appears the familiar saying /The glory of
  God is intelligence, or, in other words, light and truth/.

  From these marvelous revealed words, and /thinking in terms of sets/, we can
  conclude which of the following?

  - [ ] Intelligence is the intersection of light and truth.
  - [ ] Intelligence is the union of light and truth.
  - [ ] Intelligence is a subset of truth, and light is the name of that subset.
  - [ ] Intelligence, light and truth are all synonymous.
* TODO Justify Your Answer
#+begin_info
  Write a paragraph or two here.
#+end_info
